experiment/load-detection-shedding/result_20260209_001934__stdout_stderr.log
=== Waterlily Benchmark ===
API: single
CCU Levels: 6000
Duration: 120s
Timeout: 3s
Threads: 6
Base URL: http://0.0.0.0:8080
Timestamp: 20260209_001934

Checking health endpoint...
Health check passed

----------------------------------------
Running benchmark: API=single, CCU=6000
Output: experiment/benchmarks/result_20260209_001934_single_product_6000.json

Loaded 10000000 product IDs
Building Zipfian CDF (s=1.4, N=10000000)...
Zipfian CDF ready. Top product expected ~0.0% of requests
Loaded 10000000 product IDs
Building Zipfian CDF (s=1.4, N=10000000)...
Zipfian CDF ready. Top product expected ~0.0% of requests
Loaded 10000000 product IDs
Building Zipfian CDF (s=1.4, N=10000000)...
Zipfian CDF ready. Top product expected ~0.0% of requests
Loaded 10000000 product IDs
Building Zipfian CDF (s=1.4, N=10000000)...
Zipfian CDF ready. Top product expected ~0.0% of requests
Loaded 10000000 product IDs
Building Zipfian CDF (s=1.4, N=10000000)...
Zipfian CDF ready. Top product expected ~0.0% of requests
Loaded 10000000 product IDs
Building Zipfian CDF (s=1.4, N=10000000)...
Zipfian CDF ready. Top product expected ~0.0% of requests
Results written to: experiment/benchmarks/result_20260209_001934_single_product_6000.json

--- Benchmark Results ---
Duration: 120.07 seconds
Successes: 837911 (6978.25 RPS)
Latency: avg=255.55ms, p50=55.15ms, p95=834.84ms, p99=1326.62ms
Errors: 3xx=0, 4xx=0, 5xx=5964552, socket=4975
Access pattern: Zipfian (s=1.400000, N=0)

To get cache metrics, query: curl http://localhost:8080/monitor/cache
Running 2m test @ http://0.0.0.0:8080
  6 threads and 6000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   255.55ms  331.39ms   3.00s    82.68%
    Req/Sec     7.70k    10.55k   55.32k    79.29%
  6802463 requests in 2.00m, 5.41GB read
  Socket errors: connect 0, read 1077, write 731, timeout 3167
  Non-2xx or 3xx responses: 5964552
Requests/sec:  56651.97
Transfer/sec:     46.15MB
JSON file created successfully: experiment/benchmarks/result_20260209_001934_single_product_6000.json

========================================
Benchmark complete!
Results saved to: experiment/benchmarks
Log file: experiment/benchmarks/result_20260209_001934__stdout_stderr.log

Generated JSON files:
-rw-r--r--@ 1 hoaidv  staff  1139 Feb  9 00:22 experiment/benchmarks/result_20260209_001934_single_product_6000.json